[
  {
    "idNumber": 1,
    "id": "project--1",
    "github": "https://github.com/ReniIrinyi/PrivateProject---KiWo",
    "url": "https://kiwo-uerkental.ch/",
    "mockup": "../../../assets/img/projects/Kiwo/mockup1.webp",
    "header": "../../../assets/img/projects/Kiwo/home2.webp",
    "img1": "../../../assets/img/projects/Kiwo/home2.webp",
    "img2": "../../../assets/img/projects/Kiwo/infos.webp",
    "img3": "../../../assets/img/projects/Kiwo/gallery.webp",
    "name": "Homepage",
    "text": "I created this beautiful Landing Page for a local organisation. The project is close to my heart, it is the first project where I have had complete freedom. I tried to create a clear design, but it was important to be playful at the same time.",
    "conclusion": "The website is one of my first projects, from the end of 2022. I'm very proud of it, although I can see the flaws and where it could be improved. In the future, I would like to upload the images from the gallery to the site via a database.",
    "tech": "JavaScript, Html5, CS3, Sass",
    "description": "On the homepage you can simply check the latest information about KiWo. You can use the website to register for the following event.",
    "description2": "You can easily scroll down and up using the side menu.",
    "description3": "The gallery simply scrolls the selected img-files from an Array."
  },
  {
    "idNumber": 2,
    "id": "project--2",
    "github": "https://github.com/ReniIrinyi/Portfolio",
    "url": "https://reniirinyi.vercel.app/home",
    "mockup": "../../../assets/img/projects/PortfolioProject/home.webp",
    "header": "../../../assets/img/projects/PortfolioProject/header.webp",
    "img1": "../../../assets/img/projects/PortfolioProject/projects.webp",
    "img2": "../../../assets/img/projects/PortfolioProject/phone.webp",
    "img3": "../../../assets/img/projects/PortfolioProject/mockup.png",
    "name": "Portfolio",
    "text": "Since every decent developer has a portfolio, it seemed like a great idea to apply my newly acquired Angular skills to such a project. I really enjoyed the development and tried a bunch of new things and experimented a lot.",
    "conclusion": "The main purpose of the website is to provide a platform where I can showcase a selection of my projects. I aimed to make it dynamic, allowing for easy updates in the future. Additionally, I wanted to include a component that displays a list of all projects, and when you click on a project, it opens the corresponding project details component. Simplicity, transparency, and a design that reflects my personality were also key considerations. The site predominantly features my favorite colors, creating a cohesive and personalized aesthetic.",
    "tech": "Angular, Typescript, JavaScript, Html5, CS3, Sass",
    "description1": "Before I jumped into the implementation, I tried to put together the necessary information first. Because of the simplicity of the website, a database would have been overkill, so I saved the data for each project in a Json file. Using the Service I created, I dynamically generate projects via project-model and *ngFor directive, which I list and display as I like.",
    "description2": "The first time I came across Vincent Garreau's particles library, I think it was around 2022, and I was immediately impressed. I knew that if I ever had my own portfolio, I would definitely implement it. There are a lot of videos and blogs on the internet about how to add it to a project, but I realized that it's much simpler than that. You can find the exact description in my blog. ",
    "description3": "It was important to me that the website could be viewed from all devices, and I followed the principles of mobile-first design, so I developed the site for the smallest screen size and then worked my way up."
  },
  {
    "idNumber": 3,
    "id": "project--3",
    "github": "https://github.com/ReniIrinyi/edie-homepage",
    "url": "https://edie-homepage-beta.vercel.app/#home",
    "mockup": "../../../assets/img/projects/edie/mockup.webp",
    "header": "../../../assets/img/projects/edie/header.webp",
    "img1": "../../../assets/img/projects/edie/img1.webp",
    "name": "Homepage",
    "text": "The creation of this website belongs among the challenges on the devChallenges.io platform. ",
    "tech": "Html5, Angular, TypeScript, CS3, Sass",
    "description1": "At the beginning of my studies, when I got acquainted with HTML and CSS, I started to tackle these fantastic challenges with the aim of improving my skills. However, I reserved the last two challenges in the 'Responsive Web Development' category for the time when I would be able to solve them with the help of a framework. Now, that time has come. I am thrilled to say that I successfully completed the development of the website using Angular. I am very proud of the final result.",
    "conclusion": "The design is very simple, airy, and clean. I really liked how the layout was designed. I played a lot with flexbox and grid to achieve it."
  }
]
